app/models/event.rb

SELECT "events".* FROM "events" WHERE "events"."event_type" = $1  [["event_type", "booked"]]
---
  def self.non_overlapping_available
    available_events = Event.where(event_type: "available")
    booked_events = Event.where(event_type: "booked")


    available_events = available_events.reject do |available|
      booked_events.any? do |booked|